import React from "react";
const Struct = () => {
  return (
    <>
      <h1 className="common__container-title title">
        Структура и органы управления Уфимского филиала ФГБОУ ВО "ВГУВТ"
      </h1>
      <div className="common__container scroll-table">
        <table>
          <tbody>
            <tr>
              <td>
                Наименование органа управления/ структурного подразделения{" "}
              </td>
              <td>ФИО руководителя структурного подразделения</td>
              <td>Должность руководителя структурного подразделения</td>
              <td>Адрес местонахождения структурного подразделения</td>
              <td>Адрес официального сайта структурного подразделения</td>
              <td>Адреса электронной почты структурного подразделения</td>
              <td>
                Положение об органе управления/ о структурном подразделении
              </td>
            </tr>
            <tr>
              <td colSpan="7">
                Органы управления образовательной организации:
              </td>
            </tr>
            <tr>
              <td>Уфимский филиал </td>
              <td>Ахмадеева Фарида Шариповна</td>
              <td>директор</td>
              <td>
                450017, Приволжский ФО, Республика Башкортостан, г. Уфа, ул.
                Ахметова, 275
              </td>
              <td>www.rivercollege.ru</td>
              <td>ukru@ufanet.ru</td>
              <td>Положение о филиале</td>
            </tr>
            <tr>
              <td colSpan="7">
                Структурные подразделения образовательной организации:
              </td>
            </tr>
            <tr>
              <td>Подразделение учебной работы </td>
              <td>Мусина Гульфия Ириковна </td>
              <td>Заместитель директора филиала </td>
              <td>
                450017, Приволжский ФО, Республика Башкортостан, г. Уфа, ул.
                Ахметова, 275{" "}
              </td>
              <td>www.rivercollege.ru/kursant.htm</td>
              <td>gim_gim@mail.ru</td>
              <td>Положение о подразделении учебной работы ЭЦП</td>
            </tr>
            <tr>
              <td>Подразделение воспитательной работы </td>
              <td>Акбашева Альбина Галимзяновна </td>
              <td>Заместитель директора филиала </td>
              <td>
                450017, Приволжский ФО, Республика Башкортостан, г. Уфа, ул.
                Ахметова, 275{" "}
              </td>
              <td>www.rivercollege.ru/vospit.htm</td>
              <td>anelya.ufa@mail.ru</td>
              <td>Положение о подразделении учебной работы ЭЦП</td>
            </tr>
            <tr>
              <td>Центр организационно-правовой работы</td>
              <td></td>
              <td></td>
              <td>
                450017, Приволжский ФО, Республика Башкортостан, г. Уфа, ул.
                Ахметова, 275
              </td>
              <td>www.rivercollege.ru/opr.htm</td>
              <td></td>
              <td>Положение о подразделении учебной работы ЭЦП</td>
            </tr>
            <tr>
              <td>Административно-хозяйственный отдел</td>
              <td>Самушия Автандил Давидович</td>
              <td>Начальник административно-хозяйственного отдела</td>
              <td>
                450017, Приволжский ФО, Республика Башкортостан, г. Уфа, ул.
                Ахметова, 275
              </td>
              <td>www.rivercollege.ru</td>
              <td>rechflotufa@mail.ru</td>
              <td>Положение о подразделении учебной работы ЭЦП</td>
            </tr>
            <tr>
              <td>Бухгалтерия</td>
              <td> Жоссан Елена Евгеньевна</td>
              <td>Главный бухгалтер</td>
              <td>
                450017, Приволжский ФО, Республика Башкортостан, г. Уфа, ул.
                Ахметова, 275
              </td>
              <td>www.rivercollege.ru/bookkeeping.htm</td>
              <td>buh-ukru@ufanet.ru</td>
              <td>Положение о подразделении учебной работы ЭЦП</td>
            </tr>
            <tr>
              <td>Отдел коллективного питания</td>
              <td>Макулова Зиля Шамиловна</td>
              <td>Заведующий производством</td>
              <td>
                450017, Приволжский ФО, Республика Башкортостан, г. Уфа, ул.
                Ахметова, 275
              </td>
              <td>www.rivercollege.ru/feeding.htm</td>
              <td>ukru@ufanet.ru</td>
              <td>Положение о подразделении учебной работы ЭЦП</td>
            </tr>
          </tbody>
        </table>
      </div>
    </>
  );
};
export default Struct;
