import { observer } from "mobx-react-lite";
import React from "react";
import { toggleClassName, toggleFontSize } from "../../../../utils/disabled";
const Vacant = observer(() => {
  return (
    <div
      style={{ fontSize: toggleFontSize(1) }}
      className={toggleClassName(
        "common__container",
        "common__container-white",
        "common__container-black",
        "common__container-contrast"
      )}
    >
      <h1
        className={`common__container-title ${toggleClassName(
          "title",
          "title-white",
          "title-black",
          "title-contrast"
        )}`}
      >
        Образование
      </h1>
      <h3
        className={`common__container-title ${toggleClassName(
          "title",
          "title-white",
          "title-black",
          "title-contrast"
        )}`}
      >
        Информация о количестве вакантных мест для приема (перевода) на
        01.10.2022 г.
      </h3>
      <div className="scroll-table struct__scrollTable">
        <table className="">
          <tbody>
            <tr>
              <td rowspan="2">Код</td>
              <td rowspan="2">
                Наименование профессии, специальности, направления подготовки
              </td>
              <td rowspan="2">Уровень образования</td>
              <td rowspan="2">Курс</td>
              <td rowspan="2">Форма обучения</td>
              <td colspan="4">
                Количество вакантных мест для приема (перевода) на места,
                финансируемые за счет
              </td>
            </tr>
            <tr>
              <td> бюджетных ассигнований федерального бюджета</td>
              <td> бюджетов субъектов Российской Федерации</td>
              <td> местных бюджетов</td>
              <td>
                по договорам об образовании за счет средств физических и (или)
                юридических лиц
              </td>
            </tr>
            <tr>
              <td>-</td>
              <td>-</td>
              <td>Высшее, бакалавриат</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
            </tr>
            <tr>
              <td>-</td>
              <td>-</td>
              <td>Высшее, специалитет</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
            </tr>
            <tr>
              <td>-</td>
              <td>-</td>
              <td>Высшее, магистратура</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
            </tr>
            <tr>
              <td>-</td>
              <td>-</td>
              <td>Высшее, аспирантура</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
            </tr>
            <tr>
              <td>260203</td>
              <td>Судовождение, 9 класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>1</td>
              <td>очная</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>3</td>
            </tr>
            <tr>
              <td>260203</td>
              <td>Судовождение, 9 класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>2</td>
              <td>очная</td>
              <td>8</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
            </tr>
            <tr>
              <td>260203</td>
              <td>Судовождение, 9 класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>3</td>
              <td>очная </td>
              <td>2</td>
              <td>-</td>
              <td>-</td>
              <td>3</td>
            </tr>
            <tr>
              <td>260203</td>
              <td>Судовождение, 9 класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>4</td>
              <td>очная</td>
              <td>4</td>
              <td>-</td>
              <td>-</td>
              <td>6</td>
            </tr>
            <tr>
              <td>260203</td>
              <td>Судовождение, 9 класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>5</td>
              <td>очная</td>
              <td>5</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
            </tr>
            <tr>
              <td>260203</td>
              <td>Судовождение, 9 класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>5</td>
              <td>заочная</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>16</td>
            </tr>
            <tr>
              <td>260203</td>
              <td>Судовождение, 9 класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>6</td>
              <td>заочная</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>14</td>
            </tr>
            <tr>
              <td>260203</td>
              <td>Судовождение, 11 класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>1</td>
              <td>очная</td>
              <td>9</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
            </tr>
            <tr>
              <td>260203</td>
              <td>Судовождение, 11 класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>2</td>
              <td>очная</td>
              <td>4</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
            </tr>
            <tr>
              <td>260203</td>
              <td>Судовождение, 11 класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>3</td>
              <td>очная</td>
              <td>3</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
            </tr>
            <tr>
              <td>260203</td>
              <td>Судовождение, 11 класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>4</td>
              <td>очная</td>
              <td>8</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
            </tr>
            <tr>
              <td>260203</td>
              <td>Судовождение, 11 класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>4</td>
              <td>заочная</td>
              <td>20</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
            </tr>
            <tr>
              <td>260205</td>
              <td> Эксплуатация судовых энергетических установок, 9класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>1</td>
              <td>очная</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>4</td>
            </tr>
            <tr>
              <td>260205</td>
              <td> Эксплуатация судовых энергетических установок, 9класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>2</td>
              <td>очная</td>
              <td>8</td>
              <td>-</td>
              <td>-</td>
              <td>1</td>
            </tr>
            <tr>
              <td>260205</td>
              <td> Эксплуатация судовых энергетических установок, 9класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>4</td>
              <td>очная</td>
              <td>5</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
            </tr>
            <tr>
              <td>260205</td>
              <td>Эксплуатация судовых энергетических установок, 11 класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>3</td>
              <td>заочная</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>23</td>
            </tr>
            <tr>
              <td>260205</td>
              <td>Эксплуатация судовых энергетических установок, 11 класс</td>
              <td>Подготовка специалистов среднего звена</td>
              <td>4</td>
              <td>заочная</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>12</td>
            </tr>
            <tr>
              <td>260206</td>
              <td>
                Эксплуатация судового электрооборудования и средств автоматики
              </td>
              <td>Подготовка специалистов среднего звена</td>
              <td>1</td>
              <td>очная</td>
              <td>2</td>
              <td>-</td>
              <td>-</td>
              <td>5</td>
            </tr>
            <tr>
              <td>260206</td>
              <td>
                Эксплуатация судового электрооборудования и средств автоматики
              </td>
              <td>Подготовка специалистов среднего звена</td>
              <td>3</td>
              <td>очная</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>1</td>
            </tr>
            <tr>
              <td>260206</td>
              <td>
                Эксплуатация судового электрооборудования и средств автоматики
              </td>
              <td>Подготовка специалистов среднего звена</td>
              <td>4</td>
              <td>очная</td>
              <td>9</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
            </tr>
            <tr>
              <td>230201</td>
              <td>
                Организация перевозок и управление на транспорте (по видам)
              </td>
              <td>Подготовка специалистов среднего звена</td>
              <td>1</td>
              <td>очная</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>2</td>
            </tr>
            <tr>
              <td>230201</td>
              <td>
                Организация перевозок и управление на транспорте (по видам)
              </td>
              <td>Подготовка специалистов среднего звена</td>
              <td>2</td>
              <td>очная</td>
              <td>2</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
            </tr>
            <tr>
              <td>230201</td>
              <td>
                Организация перевозок и управление на транспорте (по видам)
              </td>
              <td>Подготовка специалистов среднего звена</td>
              <td>3</td>
              <td>очная</td>
              <td>-</td>
              <td>-</td>
              <td>-</td>
              <td>3</td>
            </tr>
          </tbody>
        </table>
      </div>
    </div>
  );
});
export default Vacant;
